sample_app/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("updated_at", "first_name", "last_name", "created_at") VALUES('2008-10-24 18:27:01', 'Raul', 'Murciano', '2008-10-24 18:27:01')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 2)
UPDATE "users" SET "last_name" = 'wefwe', "updated_at" = '2008-10-25 17:05:49', "first_name" = 'wef' WHERE "id" = 2

  def destroy
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)